# Description Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalService..::..Description Property
ExternalService Class See Also
---
The description for the service
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string Description { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Description As String
	Get
```

Visual C++
---
```text
public:
property String^ Description {
	String^ get ();
}
```

# See Also
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace